## PRACTICAL :- 4_180280116040_Dharmistha_Kosti

#### Exploring Pandas Library to perform Various Tasks for Data Handling, Wrangling , Cleaning, Description, Arrangement on selected first dataset.

In [2]:
# importing csv file
import pandas as pd
df = pd.read_csv(r'C:\Users\HP\Downloads\dataset\Customer.csv')
df

      customer_Id         DOB Gender  city_code
0          268408  02-01-1970      M        4.0
1          269696  07-01-1970      F        8.0
2          268159  08-01-1970      F        8.0
3          270181  10-01-1970      F        2.0
4          268073  11-01-1970      M        1.0
...           ...         ...    ...        ...
5642       274474  19-12-1992      M        2.0
5643       267666  24-12-1992      M        6.0
5644       270476  25-12-1992      F        3.0
5645       269626  27-12-1992      F        5.0
5646       274308  29-12-1992      F        5.0

[5647 rows x 4 columns]

In [3]:
df.head(5)

   customer_Id         DOB Gender  city_code
0       268408  02-01-1970      M        4.0
1       269696  07-01-1970      F        8.0
2       268159  08-01-1970      F        8.0
3       270181  10-01-1970      F        2.0
4       268073  11-01-1970      M        1.0

In [26]:
df.tail(5)

      Customer_ID         DOB Gender  City_code
4932       270407  29-12-1989      M        6.0
5163       267149  29-12-1990      M        1.0
5162       268251  29-12-1990      F        3.0
5385       271382  29-12-1991      F        4.0
5646       274308  29-12-1992      F        5.0

In [4]:
df.describe()

         customer_Id    city_code
count    5647.000000  5645.000000
mean   271037.281034     5.472631
std      2451.261711     2.859918
min    266783.000000     1.000000
25%    268912.000000     3.000000
50%    271028.000000     5.000000
75%    273180.000000     8.000000
max    275265.000000    10.000000

In [5]:
pd.set_option('max_colwidth', 800)

#### This particular statement sets max width to 800px, per column.

In [6]:
df.rename(columns={'customer_Id':'Customer_ID','city_code':'City_code'},inplace=True)
df.head()

   Customer_ID         DOB Gender  City_code
0       268408  02-01-1970      M        4.0
1       269696  07-01-1970      F        8.0
2       268159  08-01-1970      F        8.0
3       270181  10-01-1970      F        2.0
4       268073  11-01-1970      M        1.0

In [7]:
df.shape

(5647, 4)

In [9]:
df.columns

Index(['Customer_ID', 'DOB', 'Gender', 'City_code'], dtype='object')

In [10]:
df.dtypes

Customer_ID      int64
DOB             object
Gender          object
City_code      float64
dtype: object

In [27]:
data=df[['DOB','Gender']]
data.head()

             DOB Gender
475   01-01-1972      F
1943  01-01-1978      F
2178  01-01-1979      M
2443  01-01-1980      M
2442  01-01-1980      F

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5647 entries, 0 to 5646
Data columns (total 4 columns):
Customer_ID    5647 non-null int64
DOB            5647 non-null object
Gender         5645 non-null object
City_code      5645 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 176.6+ KB

In [17]:
df['DOB'].nunique()

4056

In [19]:
df.sort_values("DOB",axis=0,ascending=True,inplace=True)
df.head()

      Customer_ID         DOB Gender  City_code
475        272982  01-01-1972      F       10.0
1943       270066  01-01-1978      F        2.0
2178       267237  01-01-1979      M        8.0
2443       270004  01-01-1980      M        7.0
2442       271648  01-01-1980      F        1.0

In [20]:
df.isna().head()

      Customer_ID    DOB  Gender  City_code
475         False  False   False      False
1943        False  False   False      False
2178        False  False   False      False
2443        False  False   False      False
2442        False  False   False      False

In [21]:
df.isna().sum()

Customer_ID    0
DOB            0
Gender         2
City_code      2
dtype: int64

In [22]:
df.empty

False

In [23]:
df.memory_usage()

Index          45176
Customer_ID    45176
DOB            45176
Gender         45176
City_code      45176
dtype: int64

#### Return the memory usage of each column in bytes.

In [24]:
df.memory_usage(deep=True)

Index           45176
Customer_ID     45176
DOB            378349
Gender         350054
City_code       45176
dtype: int64

In [25]:
DOB_morethan=df.where(df['Customer_ID']>=274474)
DOB_morethan.reset_index()

      index  Customer_ID  DOB Gender  City_code
0       475          NaN  NaN    NaN        NaN
1      1943          NaN  NaN    NaN        NaN
2      2178          NaN  NaN    NaN        NaN
3      2443          NaN  NaN    NaN        NaN
4      2442          NaN  NaN    NaN        NaN
...     ...          ...  ...    ...        ...
5642   4932          NaN  NaN    NaN        NaN
5643   5163          NaN  NaN    NaN        NaN
5644   5162          NaN  NaN    NaN        NaN
5645   5385          NaN  NaN    NaN        NaN
5646   5646          NaN  NaN    NaN        NaN

[5647 rows x 5 columns]